In [282]:
#importujemy bibliotekę pandas
import pandas as pd

In [283]:
#wczytujemy zbiór danych
df = pd.read_csv('TitanicMess.tsv', sep='\t', header=0)

In [284]:
#wyświetlamy kilka pierwszych wierszy
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,ship
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,"7,25",NaN,S,Titanic
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,"71,2833",C85,C,Titanic
2,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,"7,925",NaN,S,Titanic
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,"53,1",C123,S,Titanic
4,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,"8,05",NaN,S,Titanic

In [285]:
#sprawdzamy ilość brakujących wartości
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            173
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          685
Embarked         2
ship             0
dtype: int64

In [286]:
#sprawdzamy czy zbiór danych zawiera kolumny tylko z jedną wartością
print(df.nunique())

#taką kolumną jest ship, która przyjmuje za każdym razem wartość Titanic

PassengerId    888
Survived         2
Pclass           3
Name           889
Sex              6
Age             93
SibSp            7
Parch            6
Ticket         680
Fare           250
Cabin          145
Embarked         6
ship             1
dtype: int64

In [287]:
#kolumny zawierające wyłącznie jedną wartość powinny być usunięte ze zbioru
#ze względu na fakt, że nic nie wnoszą do analizy

print(df.shape)

#pobieramy liczbę unikalnych warotści dla każdej kolumny
counts = df.nunique()

#poszukujemy i zapisujemy kolumny, które przyjmują wyłącznie jedną wartość
to_del = [i for i,v in enumerate(counts) if v == 1]
print(to_del)

(892, 13)
[12]

In [288]:
#usuwamy niepotrzebne kolumny
df.drop(df.columns[to_del], axis=1, inplace=True)

In [289]:
#następną kolumną poddaną analizie będzie sex, pwoinna zawierać 2 typy wartości
#na tę chwilę jest ich 6, jest to spowodowane błędami literowymi
print(df['Sex'].unique())

['male' 'female' 'malef' 'mal' 'fem' 'femmale']

In [290]:
#poprawiamy literówki w kolumnie sex
df.loc[(df['Sex'] == 'malef'),'Sex'] = 'male'
df.loc[(df['Sex'] == 'mal'),'Sex'] = 'male'

df.loc[(df['Sex'] == 'femmale'),'Sex'] = 'female'
df.loc[(df['Sex'] == 'fem'),'Sex'] = 'female'

In [291]:
#pozostały wyłącznie dwie płcie 
print(df['Sex'].unique())

['male' 'female']

In [292]:
#kolumna survived nie budzi żadnych podejrzeń
print(df['Survived'].unique())

[0 1]

In [293]:
#kolumna pclass tak samo
print(df['Pclass'].unique())

[3 1 2]

In [294]:
#kolumna kabin zawiera bardzo dużo brakujących wartości
#sensowne wydaje się usunięcie jej
df['Cabin'].isna().sum()

685

In [295]:
#usuwamy kolumnę cabin
df.drop('Cabin', axis='columns', inplace=True)

In [296]:
#kolumna embarked zawiera 7 wartości, ich liczba powinna ograniczyć się do 3
#- po jednej dla każdego miasta, w którym się zatrzymałTitanic
print(df['Embarked'].unique())

['S' 'C' 'Q' 'So' nan 'Co' 'Qe']

In [297]:
#poprawiamy literówki
df.loc[(df['Embarked'] == 'So'),'Embarked'] = 'S'
df.loc[(df['Embarked'] == 'Co'),'Embarked'] = 'C'
df.loc[(df['Embarked'] == 'Qe'),'Embarked'] = 'Q'

In [298]:
print(df['Embarked'].unique())

['S' 'C' 'Q' nan]

In [299]:
#usuwanie wierszy dla kótrych Embarked przyjumuje NaN
df = df.dropna(axis='index',subset=['Embarked'])

In [300]:
#kolumna sibsp prezentuje się bez zastrzeżeń 
print(df['SibSp'].unique())

[1 0 3 4 2 5 8]

In [301]:
#kolumna parch tak samo
print(df['Parch'].unique())

[0 1 2 5 3 4]

In [302]:
#ostatnią kolumną do poprawy jest age, zawiera dość sporo wartości pustych, usuniemy je
df['Age'].isna().sum()

173

In [303]:
#usuwanie wierszy dla kótrych Age przyjumuje NaN
df = df.dropna(axis='index',subset=['Age'])

In [304]:
#w zbiorze nie została już żadna pusta wartość oraz wyeliminowano wszystkie literówki
df.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [305]:
#podgląd pierwszych dziesięciu wierszy tabeli
df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,"7,25",S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,"71,2833",C
2,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,"7,925",S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,"53,1",S
4,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,"8,05",S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54,0,0,17463,"51,8625",S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2,3,1,349909,"21,075",S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27,0,2,347742,"11,1333",S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14,1,0,237736,"30,0708",C
10,11,1,3,"Sandstrom, Miss. Marguerite Ru&5$$",female,4,1,1,PP 9549,"16,7",S

In [307]:
#utworzenie pliku csv na podstawie oczyszczonych danych
df.to_csv('TitanicCleaned.tsv', sep='\t', index=False)

In [308]:
#PODSUMOWANIE

#Celem pracy było przygotowanie zbioru do analizy.
#W ramach oczyszczania danych, pozbyto się wartości NaN,
#przejęzyczeń oraz usunięto niewiele wnoszące kolumny.
#Ostanim krokiem był zapis wprowadzonych zmian do nowo
#utworzonego pliku.